      * Licensed Materials - Property of IBM
      *
      * (c) Copyright IBM Corp. 2016.
      *
      * US Government Users Restricted Rights - Use, duplication or
      * disclosure restricted by GSA ADP Schedule Contract
      * with IBM Corp.
           03 GETCompanyOperation.
             06 company-name pic x(40).
