      * Licensed Materials - Property of IBM
      *
      * (c) Copyright IBM Corp. 2020.
      *
      * US Government Users Restricted Rights - Use, duplication or
      * disclosure restricted by GSA ADP Schedule Contract
      * with IBM Corp.
       77 SORTCODE           PIC 9(6) VALUE 987654.