      * Licensed Materials - Property of IBM
      *
      * (c) Copyright IBM Corp. 2015,2016.
      *
      * US Government Users Restricted Rights - Use, duplication or
      * disclosure restricted by GSA ADP Schedule Contract
      * with IBM Corp.
           05 Customer-Number-Key.
              10 CNO-KEY                  PIC 9(10) DISPLAY.
